[
    {
        "id" : 1,
        "title" : "Hardcore Java",
        "coverId" : 5,
        "description" : "Java has quickly become one of the most important languages in programming, particularly for professional and enterprise-level projects. From its infancy as a language primarily used for web applets to its maturity through servlets, Enterprise JavaBeans, and database access, Java has become a complex and robust tool for today's developer.Hardcore Java takes this language and breaks it apart, piece by piece, revealing the important secrets and tricks that will take you from a junior-level programmer to a seasoned and expert developer."
    },
    {
        "id" : 2,
        "title" : "Python 3",
        "coverId" : 4,
        "description" : "Подробное руководство, Марк СаммерфилдТретья версия языка Python сделала его еще более мощным, удобным, логичным и выразительным. Книга «Программирование на Python 3» написана одним из ведущих специалистов по этому языку, обладающим многолетним опытом работы с ним. Издание содержит все необходимое для практического освоения языка: написания любых программ с использованием как стандартной библиотеки, так и сторонних библиотек для языка Python 3" 
    },
    {
        "id" : 3,
        "title" : "Изучаем Python",
        "coverId" : 3,
        "description" : "ускоренный курс, который позволит вам сэкономить время и сразу начать писать работоспособные программы (игры, визуализации данных, веб-приложения и многое другое). Хотите стать программистом? В первой части книги вам предстоит узнать о базовых принципах программирования, познакомиться со списками, словарями, классами и циклами, вы научитесь создавать программы и тестировать код." 
    },
    {
        "id" : 4,
        "title" : "JavaScript для дiтей",
        "coverId" : 2,
        "description" : "«JavaScript для дітей» — веселий посібник, вступ до основ програмування, із яким ви крок за кроком опануєте роботу з рядками, масивами та циклами, інструментами DOM та jQuery та елементом canvas для малювання графіки. Ви зможете писати та модифікувати HTML-елементи для створення динамічних веб-сторінок та напишете класні онлайн ігри «Знайди захований скарб», «Шибениця» та «Змійка». У цій книжці — безліч цікавих прикладів та кумедних ілюстрацій, а завдання з програмування наприкінці кожного розділу, надихнуть на створення власних приголомшливих програм. Утнімо щось крутецьке із JavaScript!" 
    },
    {
        "id" : 5,
        "title" : "С++ для чайников",
        "coverId" : 1,
        "description" : "Язык C++ (произносится как «Си плюс плюс») был разработан Бьёрном Страуструпом в подразделении Bell Labs компании AT&T в качестве дополнения к языку C в 1979 г. Он добавил множество новых возможностей в язык С. Его популярность была вызвана объектно-ориентированностью языка. Сейчас C++ широко используется для разработки программного обеспечения, являясь одним из самых популярных языков программирования. С его помощью создают операционные системы, разнообразные прикладные программы, драйвера устройств, игры и пр." 
    }

]